Application/backend/views/servicereport/_form.php

SELECT * FROM `weatherstation`
---
    <?php $form = ActiveForm::begin(['options' => ['enctype' => 'multipart/form-data']]); ?>


         <?= $form->field($model, 'WeatherStation_id')->widget(Select2::classname(), [
            'data' => ArrayHelper::map(WeatherStation::find()->all(),'id','WeatherStation_Location'),
            'language' => 'en',
            'options' => ['placeholder' => 'Select a Location ...'],
            'pluginOptions' => [
                'allowClear' => true
                    ],
            ]); ?>