Application/backend/controllers/AuthAssignmentController.php

INSERT INTO `auth_assignment` (`item_name`, `user_id`) VALUES ('Normal\r\n', 5)
---
    public function actionCreate()
    {
        $model = new AuthAssignment();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {

SELECT * FROM `auth_assignment` WHERE (`item_name`='Normal\r\n') AND (`user_id`='5')
---
    protected function findModel($item_name, $user_id)
    {
        if (($model = AuthAssignment::findOne(['item_name' => $item_name, 'user_id' => $user_id])) !== null) {