Application/backend/controllers/ServicereportController.php

SELECT * FROM `servicereport` WHERE `id`='6'
---
    protected function findModel($id)
    {
        if (($model = Servicereport::findOne($id)) !== null) {