Application/backend/controllers/WeatherstationController.php

    public function actionCreate()
    {


             $model = new Weatherstation();

            if ($model->load(Yii::$app->request->post()) && $model->save()) {
---
INSERT INTO `weatherstation` (`WeatherStation_Model`, `WeatherStation_Name`, `WeatherStation_Location`, `WeatherStation_Status`, `WeatherStation_Gateway`, `WeatherStation_Logger`, `WeatherStation_Number`) VALUES ('1029-1920', 'Dr.Weather', 'Paranaque', 'On', 'GLOBE', 'GLOBE', '09019392811')

    protected function findModel($id)
    {
        if (($model = Weatherstation::findOne($id)) !== null) {
---
SELECT * FROM `weatherstation` WHERE `id`='8'